#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//int main()
//{//数组
	//int i = 0;
	//int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };//数组下标从0开始，可以用下标访问元素
	//printf("%d\n", arr[4]);//访问下表为四的元素
	////循环语句打印数组中所有数
	//
	//while (i < 10)
	//{
	//	printf("%d\n", arr[i]);

	//	i++;
	//}

	//int a = 5 % 2;//5除以二余一 5模2

	////移位操作符
	//int b = 1;//二进制左移下面移动一位01变成10
	// int c =b << 1;
	// printf("%d\n", c);
	//printf("%d\n", a);


	//& 按位与
	//| 按位或
	//^ 按位异或
	//int a = 3;  //011 得001
	//int b = 5;  //101 见假则假 合取式
	//int c =a&b;
	//printf("%d", c);
	
	//|  //011
	     //101   得111 见真则真   析取式
	//^  //110
	     //101   得011 异则为真 


	//int a = 10;
	//a = 20;//赋值   == 判断相等
	//
	//int a;
	//a = a + 10;
	//a += 10;//等价
	//复合赋值符
	//如 += -= *= /= %= >>= <<= &= |= ^=


	//单目操作符
	//双目操作符
	//三目操作符

	//int a = 19;
	//int b = 47;
	//a + b;//双目操作符，有两个操作数



	////!逻辑反操作
	//int a = -10;//-为单目操作符
	//int  b = 0;
	//printf("%d\n", a);
	//printf("%d\n", !a);//把a= 10变真为假 变为0 计算机中1为真0为假
	//	printf("%d\n",!b);//把b=0 变为真 变为1

//	int a = 17;
//	char arr[10] = { 0 };
//	int c;
//	printf("%d\n", sizeof(a)); //计算变量或数据类型大小  4
//	c =sizeof(arr) / sizeof(0);//数组总大小/数组单个元素大小等于数组中元素个数 10
//	printf("%d\n", c);
//	printf("%d", sizeof(arr));
//return 0;
//} 
